package Java;

public class a02_Java {
	/*
	 * 자바란?
	 * 객체 지향 언어로 개발된 프로그래밍 언어
	 * 자바 가상 머신(JVM, Java Virtual Machine)을 사용하여, 운영체제와는 독립적으로 동작할 수 있음
	 * 따라서 자바는 어느 운영체제에서나 같은 형태로 실행될 수 있음
	 * 
	 * 자바의 역사
	 * 처음에 자바는 가전제품 내에서 동작하는 임베디드 프로그램을 위한 언어로 썬 마이크로시스템즈(Sun Microsystems)사의 제임스 고슬링(James Gosling) 팀에 의해 개발됨
	 * 1991년 오크(Oak)라는 이름으로 시작하여, 1996년에 발표된 1.0.2 버전부터 자바라는 이름을 사용
	 * 1998년 발표된 J2SE 1.2에서는 웹에서도 자바를 돌릴 수 있게 해주는 자바 애플릿(Java Applet)이 추가되며, 자바의 인기는 급상승함
	 * 그후 버전이 업데이트될 때마다 다양한 기능이 지원
	 * 2009년에 썬 마이크로시스템즈사가 오라클과 인수합병됨에 따라 자바 또한 오라클로 소유권이 넘어감
	 * 
	 * 자바의 특징
	 * 	장점
	 * 	1. 운영체제와 독립적으로 실행할 수 있음
	 * 	2. 불팔요한 기능을 과감히 제거하여 다른 언어에 비해 배우기가 쉬움
	 * 	3. 자동 메모리 관리 등을 지원하여 다른 언어에 비해 안정성이 높음
	 * 	4. 연산자 오버로딩을 금지하고 제네릭을 도입함으로써 코드의 가독성을 높임
	 * 	5. 수많은 참고 자료를 찾을 수 있음
	 * 	단점
	 * 	1. 실행을 위해 자바 가상 머신을 거쳐야 하므로, 다른 언어에 비해 실행속도가 느림
	 * 	2. 예외 처리가 잘 되어있지만, 개발자가 일일이 처리를 지정해줘야 한다는 불편함이 있음
	 * 	3. 다른 언어에 비해 작성해야하는 코드의 길이가 긴 편
	 */
}
