package Java;

public class a03_JavaProgramming {
	/*
	 * 자바 프로그램의 실행 과정
	 * 	컴파일 타임 환경
	 * 		자바 클래스 파일(.java) -> 자바 컴파일러 -> 자바 바이트 코드(.class) (-> 런타임 환경 클래스 로더 로 넘어감)
	 * 	런타임 환경
	 * 			ㄴ- 자바 클래스 라이브러리 파일
	 * 		클래스 로더 -> |자바 인터프리터 -> 런타임 시스템| -> 운영체제 -> 하드웨어
	 * 				 \> |JIT 컴파일
	 * 					---------------------------
	 * 							|
	 * 							V
	 * 						자바 가상 머신(JVM)
	 * 
	 * 자바 컴파일러(Java compiler)
	 * 자바를 가지고 작성한 자바 소스 코드를 자바 가상머신이 이해할 수 있는 자바 바이트 코드로 변환
	 * 자바 컴파일러는 자바를 설치하면 javac.exe라는 실행 파일 형태로 설치
	 * 
	 * 자바 바이트 코드(Java bytecode)
	 * 자바 가상 머신이 이해할 수 있는 언어로 변환된 자바 소스 코드를 의미
	 * 자바 컴파일러에 의해 변환되는 코드의 명렁어 크기가 1바이트라서 자바 바이트 코드라고 불림
	 * 자바 바이트 코드의 확장자는 .class
	 * 자바 가상 머신만 설치되어 있으면, 어떤 운영체제에서라도 실행될 수 있음
	 * 
	 * 자바 가상 머신(JVM Java Virtual Machine)
	 * 자바 바이트 코드를 실행시키기 위한 가상의 기계라고 할 수 있음
	 * 자바로 작성된 모든 프로그램은 자바 가상 머신에서만 실행될 수 있으므로, 자바 프로그램을 실행하기 위해서는 반드시 자바 가상 머신이 설치되어 있어야 함
	 * 따라서 오라클은 대부분의 주요 운영체제뿐만아니라 웹 브라우저, 스마트폰, 가전기기 등에서도 자바 가상 머신을 손쉽게 설치할 수 있도록 지원함
	 * 서로 다른 운영체제라도 jvm만 설치되어 있따면 아무런 추가 조치없이 동작할 수 있음
	 * 따라서 개발자는 한번만 프로그램을 작성하면, 모든 운영체제에서 같이 사용할 수 있는 장점이 있음
	 * 단, jvm은 운영체제에 종속적이므로 각 운영체제에 맞는 jvm을 설치해야함
	 * 또한, jvm이라는 한 단계를 거쳐야하므로, 상대적으로 실행 속도가 느리다는 단점이 있음
	 * 
	 * 자바 가상 머신의 구성
	 * 1. 자바 인터프리터(interpreter)
	 * 	컴파일러에 의해 변환된 자바 바이트 코드를 읽고 해석하는 역할
	 * 2. 클래스 로더(class loader)
	 * 	동적으로 클래스를 읽어오므로, 프로그램이 실행 중인 런타임에서야 모든 코드가 jvm과 연결됨
	 * 	이렇게 동적으로 클래스를 로딩해주는 역할을 함
	 * 3. JIT 컴파일러(Just-In-Time compiler)
	 * 	프로그램이 실행중인 런타임에 실제 기계어로 변환해주는 컴파일러를 의미
	 * 	동적 변역(dynamic translation)이라고도 불리는 이기법은 프로그램의 실행 속도를 향상시키기 위해 개발됨
	 * 	즉, JIT 컴파일러는 자바 컴파일러가 생성한 자바 바이트 코드를 런타임에 바로 기계어로 변환하는데 사용함
	 * 4. 가비지 컬렉터(garbage collector)
	 * 	더는 사용하지 않는 메모리를 자동으로 회수해줌
	 * 	따라서 개발자가 따로 메모리를 관리하지 않아도 되므로, 더욱 손쉽게 프로그래밍을 할 수 있도록 도와줌
	 * 
	 */
}
