package Java;

public class a04_JavaProgram {
	/*
	 * 간단한 자바 프로그램
	 * 자바 프로그램은 한 개 이상의 클래스로 구성됨
	 * 이러한 클래스는 한 개 이상의 필드(field)나 메소드(method)로 구성됨
	 * 
	 * 간단한 자바 프로그램의 기본 구조
	 * 	class 클래스이름{
	 * 		필드의 선언
	 * 		
	 * 		메소드의 선언
	 * 	}
	 * 	class Test{
	 * 		int field1;
	 * 		String field2;
	 * 
	 * 		public void method1(){
	 * 			System.out.println("자바 프로그래밍!");
	 * 		}
	 * 	}
	 * 
	 * main() 메소드
	 * 자바 프로그램이 실행되면 맨 먼저 메인 메소드를 찾아 그 안의 모든 명령문을 차례대로 실행함
	 * 따라서 하나의 자바 프로그램에는 메인 메소드를 가지는 클래스가 반드시 하나는 존재해야함
	 * 
	 * 명령문(statement)
	 * 동작을 명시하고, 이러한 동작을 컴퓨터에 알려주는데 사용되는 문장을 명령문이라함
	 * 자바의 모든 명령문은 반드시 세미콜론(;)으로 끝나야함
	 * 
	 * 주석(comment)
	 * 코드에 대한 이해를 돕는 설명을 적거나 디버깅을 위해 작성하는 일종의 메모
	 * 컴파일러는 주석은 무시하고 컴파일하므로, 실제 실행 결과에는 아무런 영향을 주지 않음
	 * 한줄 주석 // 여러줄 주석 /* * /
	 */
}
