package Java;

public class a23_Array {
	/*
	 * 배열
	 * 같은 타입의 변수들로 이루어진 유한 집합으로 정의할 수 있음
	 * 배열을 구성하는 각각의 배열 요소(element)라고하며, 배열에서의 위치를 가리키는 숫자를 인덱스(index)라고 함
	 * 인덱스는 0부터 시작하며, 0을 포함한 양의 정수만을 가질 수 있음
	 * 
	 * 1차원 배열
	 * 	문법
	 * 	1. 타입[] 배열이름;
	 * 	2. 타입 배열이름[];
	 * 
	 * 배열 생성
	 * 	배열이름 = new 타입[배열길이];
	 * 
	 * 	배열의 타입		초깃갑
	 * 	char			'\u0000'
	 * 	byte,short,int	0
	 * 	long			0L
	 * 	float			0.0F
	 * 	double			0.0 or 0.0D
	 * 	boolean			false
	 * 	배열,인스턴스 등	null
	 * 
	 * 배열의 길이를 초과하는 인덱스를 사용하면 ArrayIndexOutOfBounds 예외 발생
	 * 
	 * 배열의 초기화
	 * 괄호를 사용하여 초깃갑을 나열한 것을 초기화 블록(initialization block)이라고 함
	 * 	문법
	 * 	1. 타입[] 배열이름 = {요소1, 요소2, ...};
	 * 	2. 타입[] 배열이름 = new 타입[]{요소1, 요소2...};
	 */
}
