package Java;

public class a28_class {
	/*
	 * 클래스의 선언
	 * 클래스란 객체 지향 프로그래밍의 추상화(abstraction)라는 개념을 직접 구현한 것
	 * 자바에서는 유용하게 사용할 수 있는 많은 수의 클래스를 미리 정의하여 제공함
	 * 또한, 원하는 동작을 하는 새로운 클래스를 손쉽게 작성할 수 있음
	 * 	정의
	 * 	접근제어자 class 클래스이름{
	 * 		접근제어자 필드1의타입 필드1의이름;
	 * 
	 * 		접근제어자 메소드1의 원형
	 * 	}
	 * 접근제어자는 객체지향 프로그래밍의 특징 중 하나인 정보 은닉(data hiding)을 위한 키워드
	 * public 멤버는 모든 객체에서 접근할 수 있지만, private 멤버는 해당 객체내의 멤버 변수나 메소드만이 접근할 수 있음
	 * 
	 * 인스턴스의 생성
	 * 	선언
	 * 	클래스이름 객체참조변수이름;
	 * 그 후에 new 키워드를 사용하여 인스턴스를 생성하고, 해당 인스턴스의 주소를 미리 선언한 참조 변수에 저장하여 사용
	 * 	선언
	 * 	객체참조변수이름 = new 클래스이름();
	 * 선언과 인스턴스의 생성을 동시에 할 수도 있음
	 */
}
