package Java;

public class a29_method {
	/*
	 * 메소드
	 * 어떠한 특정 작업을 수행하기 위한 명령문의 집합이라 할 수 있음
	 * 
	 * 메소드의 사용 목적
	 * 중복되는 코드의 반복적인 프로그래밍을 피할 수 있기 때문
	 * 또한, 모듈화로 인해 코드의 가독성도 좋아짐
	 * 그리고 프로그램에 문제가 발생하거나 기능의 변경이 필요할 때도 손쉽게 유지보수를 할 수 있음
	 * 
	 * 메소드 정의
	 * 	문법
	 * 	접근제어자 반환타입 메소드이름(매개변수목록){	// 선언부
	 * 		// 구현부
	 * 	}
	 * 		1. 접근 제어자 : 해당 메소드에 접근할 수 있는 범위를 명시
	 * 		2. 반환 타입(return type) : 메소드가 모든 작업을 마치고 반환하는 데이터의 타입을 명시
	 * 		3. 메소드 이름 : 메소드를 호출하기 위한 이름을 명시
	 * 		4. 매개변수 목록(parameters) : 메소드 호출 시에 전달되는 인수의 값을 저장할 변수들을 명시
	 * 		5. 구현부 : 메소드의 고유 기능을 수행하는 명령문의 집합
	 * 
	 * 메소드 호출
	 * 멤버 참조 연산자(.)를 사용하여 호출할 수 있음
	 * 	문법
	 * 	1. 객체참조변수이름.메소드이름();	// 매개변수가 없는 메소드의 호출
	 * 	2. 객체참조변수이름.메소드이름(인수1, 인수2);	// 매개변수가 있는 메소드의 호출
	 */
}
